# EngagementLength Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
Connector..::..EngagementLength Property
Connector Class See Also
---
Connector engagement length
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public double EngagementLength { get; }
```

Visual Basic
---
```text
Public ReadOnly Property EngagementLength As Double
	Get
```

Visual C++
---
```text
public:
property double EngagementLength {
	double get ();
}
```

# See Also
Connector Class
Autodesk.Revit.DB Namespace